# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Link, [1]] # 0
  - [-1, 1, apart1, [4, 3]] # 1
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 5
  - [-1, 6, C2f, [256, True]]     # S3
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 6, C2f, [512, True]]      # S4
  - [-1, 1, Conv, [1024, 3, 2]] # 9
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11

  - [0, 1, apart2, [4, 1]] # 12
  - [-1, 1, Conv, [64, 3, 2]] # 13
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]] # 15
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]] # 17 S3
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]] # 19  S4
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]] # 21
  - [-1, 1, SPPF, [1024, 5]] # 22

# head
head:
  - [-1, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ] # 23
  - [-1, 1, AIFI, [ 1024, 8 ] ]
  - [-1, 1, Conv, [ 256, 1, 1 ] ] # 25

  - [-1, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ] # 26
  - [-1, 1, AIFI, [ 1024, 8 ] ] # 27
  - [-1, 1, Conv, [ 256, 1, 1 ] ] # 28

  - [25, 1, nn.Upsample, [None, 2, "nearest"]] # 29
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]] # 31
  - [28, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [19, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ] # 33
  - [[-2, -1 ], 1, Concat, [ 1 ] ]
  - [[31, -1 ], 1, Concat, [ 1 ] ] # 35
  - [-1, 3, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]] # 37

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 38
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 39
  - [[-2, -1 ], 1, Concat, [ 1 ] ]
  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 41
  - [[-2, -1 ], 1, Concat, [ 1 ] ]
  - [-1, 3, RepC3, [256]] # 43

  - [-1, 1, Conv, [256, 3, 2]] # 44
  - [[-1, 37], 1, Concat, [ 1 ] ] # 45
  - [-1, 3, RepC3, [256]] # 46

  - [-1, 1, Conv, [256, 3, 2]] # 47
  - [[-1, 25], 1, Concat, [ 1 ] ]
  - [[-1, 28], 1, Concat, [ 1 ] ] # 49
  - [-1, 3, RepC3, [256]] # 50

  - [[43, 46, 50], 1, RTDETRDecoder, [nc]] # 51