# Parameters
nc: 7  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Link, [1]] # 0
  - [-1, 1, apart1, [4, 3]] # 1
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 5
  - [-1, 6, C2f, [256, True]]     # S3
  - [-1, 1, Conv, [512, 3, 2]] # 7
  - [-1, 6, C2f, [512, True]]      # S4
  - [-1, 1, Conv, [1024, 3, 2]] # 9
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11

  - [0, 1, apart2, [4, 1]] # 12
  - [-1, 1, MaxPool, [2, 2]] # 13
  - [-1, 1, MaxPool, [2, 2]] # 14
  - [-1, 1, MaxPool, [2, 2]] # 15 R3
  - [-1, 1, MaxPool, [2, 2]] # 16 R4
  - [-1, 1, MaxPool, [2, 2]] # 17 R5

# head
head:
  - [11, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ] # 18
  - [-1, 1, AIFI, [ 1024, 8 ] ] # 19
  - [-1, 1, Conv, [ 256, 1, 1 ] ] # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]] # 23
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 25
  - [-1, 1, Conv, [256, 1, 1]] # 26

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 27
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]] # 29
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 31

  - [-1, 1, Conv, [256, 3, 2]] # 32
  - [[-1, 26], 1, Concat, [1]] # 33
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 35

  - [-1, 1, Conv, [256, 3, 2]] # 36
  - [[-1, 20], 1, Concat, [1]] # 37
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 39

  - [[31, 35, 39], 1, RTDETRDecoder, [nc]]